## Lesson 3
# Pandas

In [2]:
# Importing Libraries
import pandas as pd

In [5]:
# Basic data table in Pandas

df = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}, index=['x','y','z'])
df.head()

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

In [7]:
# Getting just 2 rows
df.head(2)

   A  B  C
x  1  4  7
y  2  5  8

In [9]:
# Getting from bottom to top
df.tail()

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

In [10]:
# Getting just 2 rows
df.tail(2)

   A  B  C
y  2  5  8
z  3  6  9

In [11]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [13]:
df.index.tolist()

['x', 'y', 'z']

In [14]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [15]:
df['A'].unique()

array([1, 2, 3])

In [16]:
df.shape

(3, 3)

In [17]:
df.size

9

In [18]:
# Reading CSV file

coffee = pd.read_csv("./assets/coffee.csv")
coffee.head(4)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [20]:
# Reading Parquet file

results = pd.read_parquet("./assets/results.parquet")
results.head(4)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None

In [21]:
bios = pd.read_csv("./assets/bios.csv")
bios.head(4)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20

In [22]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [23]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
# Using loc in Pandas
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [25]:
coffee.loc[3]

Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object

In [27]:
# Using array in fetching the locs in Pandas

coffee.loc[[0,1,5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

In [28]:
# Using range in loc in Pandas

coffee.loc[0:5]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [30]:
# Fetching locations but rolling out some columns
coffee.loc[0:5, ["Day", "Units Sold"]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35
5  Wednesday          25

In [31]:
# Using iloc to filter columns

coffee.iloc[0:5, [0, 2]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [33]:
# Changing the index

coffee.index = coffee["Day"]
coffee.head(14)

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [35]:
# Filter the amount
coffee = pd.read_csv("./assets/coffee.csv")
coffee.loc[1, 'Units Sold'] = 10
coffee.head(3)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          10
2  Tuesday    Espresso          30

In [36]:
coffee.loc[1:3, 'Units Sold'] = 10
coffee.head(4)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          10
2  Tuesday    Espresso          10
3  Tuesday       Latte          10

In [37]:
# Sorting base on values
coffee.sort_values(["Coffee Type", "Units Sold"])

          Day Coffee Type  Units Sold
2     Tuesday    Espresso          10
0      Monday    Espresso          25
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
1      Monday       Latte          10
3     Tuesday       Latte          10
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35

In [38]:
# Sorting base on values ascending
coffee.sort_values(["Coffee Type", "Units Sold"], ascending=[0,1])

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          10
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          10
0      Monday    Espresso          25
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [39]:
# Extracting data for Python
for index, row in coffee.iterrows():
    print(index, row['Coffee Type'])

0 Espresso
1 Latte
2 Espresso
3 Latte
4 Espresso
5 Latte
6 Espresso
7 Latte
8 Espresso
9 Latte
10 Espresso
11 Latte
12 Espresso
13 Latte